import re
import heapq


test_text = "Этому мешают четыре препятствия. Первое состоит в том, что человеку с раннего детства внушают, что то, чего он в жизни больше всего желает, просто неосуществимо. С этой мыслью он вырастает, и с каждым прожитым годом его душа все больше обрастает коростой многочисленных предрассудков и страхов, переполняется чувством вины. И однажды наступает момент, когда желание следовать Своей Судьбе оказывается погребенным под тяжестью этого груза, и тогда человеку начинает казаться, что он окончательно утратил ощущение своего высшего предназначения. Хотя на самом деле оно, разумеется, по-прежнему живет в его душе.Если человеку все же хватит мужества извлечь свою мечту из недр души и не отказаться от борьбы за ее осуществление, его ожидает следующее испытание: любовь. Он знает, чего хотел бы добиться или испытать в жизни, но боится, что, если бросит все и последует за своей мечтой, он тем самым причинит боль и страдания своим близким. Это значит, что человек не понимает, что любовь не преграда, она не мешает, а, наоборот, помогает идти вперед. И тот, кто действительно желает ему добра, всегда готов пойти ему навстречу, постараться понять и поддержать его в пути.Когда человек осознает, что любовь не преграда, а подмога в пути, его подстерегает третье препятствие: страх неудач и поражений. Тот, кто борется за свою мечту, сильнее других страдает, когда у него что-то не получается, поскольку он не вправе прибегнуть к известной отговорке: «Ну и ладно, не очень-то и хотелось». Как раз ему-то"


def make_sort_text(text):
    sentences = re.split(r' *[\.\?!][\’”\)\]]* *', text)

    clean_text = text.lower()
    word_tokenize = clean_text.split()

    stop_words = ["а","е","и","ж","м","о","на","не","ни","об","но","он","мне","мои","мож","она","они","оно","мной","много","многочисленное","многочисленная","многочисленные","многочисленный","мною","мой","мог","могут","можно","может","можхо","мор","моя","моё","мочь","над","нее","оба","нам","нем","нами","ними","мимо","немного","одной","одного","менее","однажды","однако","меня","нему","меньше","ней","наверху","него","ниже","мало","надо","один","одиннадцать","одиннадцатый","назад","наиболее","недавно","миллионов","недалеко","между","низко","меля","нельзя","нибудь","непрерывно","наконец","никогда","никуда","нас","наш","нет","нею","неё","них","мира","наша","наше","наши","ничего","начала","нередко","несколько","обычно","опять","около","мы","ну","нх","от","отовсюду","особенно","нужно","очень","отсюда","в","во","вон","вниз","внизу","вокруг","вот","восемнадцать","восемнадцатый","восемь","восьмой","вверх","вам","вами","важное","важная","важные","важный","вдали","везде","ведь","вас","ваш","ваша","ваше","ваши","впрочем","весь","вдруг","вы","все","второй","всем","всеми","времени","время","всему","всего","всегда","всех","всею","всю","вся","всё","всюду","г","год","говорил","говорит","года","году","где","да","ее","за","из","ли","же","им","до","по","ими","под","иногда","довольно","именно","долго","позже","более","должно","пожалуйста","значит","иметь","больше","пока","ему","имя","пор","пора","потом","потому","после","почему","почти","посреди","ей","два","две","двенадцать","двенадцатый","двадцать","двадцатый","двух","его","дел","или","без","день","занят","занята","занято","заняты","действительно","давно","девятнадцать","девятнадцатый","девять","девятый","даже","алло","жизнь","далеко","близко","здесь","дальше","для","лет","зато","даром","первый","перед","затем","зачем","лишь","десять","десятый","ею","её","их","бы","еще","при","был","про","процентов","против","просто","бывает","бывь","если","люди","была","были","было","будем","будет","будете","будешь","прекрасно","буду","будь","будто","будут","ещё","пятнадцать","пятнадцатый","друго","другое","другой","другие","другая","других","есть","пять","быть","лучше","пятый","к","ком","конечно","кому","кого","когда","которой","которого","которая","которые","который","которых","кем","каждое","каждая","каждые","каждый","кажется","как","какой","какая","кто","кроме","куда","кругом","с","т","у","я","та","те","уж","со","то","том","снова","тому","совсем","того","тогда","тоже","собой","тобой","собою","тобою","сначала","только","уметь","тот","тою","хорошо","хотеть","хочешь","хоть","хотя","свое","свои","твой","своей","своего","своих","свою","твоя","твоё","раз","уже","сам","там","тем","чем","сама","сами","теми","само","рано","самом","самому","самой","самого","семнадцать","семнадцатый","самим","самими","самих","саму","семь","чему","раньше","сейчас","чего","сегодня","себе","тебе","сеаой","человек","разве","теперь","себя","тебя","седьмой","спасибо","слишком","так","такое","такой","такие","также","такая","сих","тех","чаще","четвертый","через","часто","шестой","шестнадцать","шестнадцатый","шесть","четыре","четырнадцать","четырнадцатый","сколько","сказал","сказала","сказать","ту","ты","три","эта","эти","что","это","чтоб","этом","этому","этой","этого","чтобы","этот","стал","туда","этим","этими","рядом","тринадцать","тринадцатый","этих","третий","тут","эту","суть","чуть","тысяч"]

    word2count = {}
    for word in word_tokenize:
        if word not in stop_words:
            if word not in word2count.keys():
                word2count[word] = 1
            else:
                word2count[word] += 1

    sent2score = {}
    for sentence in sentences:
        for word in sentence.split():
            if word in word2count.keys():
                if len(sentence.split(' ')) < 15 and len(sentence.split(' ')) > 3:
                    if sentence not in sent2score.keys():
                        sent2score[sentence] = word2count[word]
                    else:
                        sent2score[sentence] += word2count[word]

    # взвешенная гистограмма
    for key in word2count.keys():
        word2count[key] = word2count[key] / max(word2count.values())

    best_three_sentences = heapq.nlargest(1, sent2score, key=sent2score.get)
    print(*best_three_sentences)
    return best_three_sentences

